InformationRegisters/СведенияОСтавкахИПНиСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСтавкахИПНиСН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДоходаС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоходаПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНалогаПредыдущегоПредела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСтавокИПНиСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтавокИПНиСН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСтавокИПНиСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыСтавокИПНиСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоИсчислениюИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИсчислениюСНДляГражданРК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоИсчислениюСНДляИностранныхСпециалистов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СведенияОСтавкахИПНиСН/Forms/ФормаНабораЗаписей/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = ПолучитьПоследнийПериодЗаписей();
	УстановитьОтборыДинамическогоСписка(Список, Период);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ДекорацияСтавки2009Нажатие(Элемент)
	
	ОткрытьФорму("РегистрСведений.СведенияОСтавкахНалоговСборовОтчислений.ФормаСписка");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборыДинамическогоСписка(Список, Период)
	

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
																			"ВидСтавокИПНиСН", 
																			ПредопределенноеЗначение("Перечисление.ВидыСтавокИПНиСН.ПоИсчислениюИПН"), 
																			ВидСравненияКомпоновкиДанных.Равно, 
																			, 
																			Истина, 
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
																			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, 
																			"Период", 
																			Период, 
																			ВидСравненияКомпоновкиДанных.Равно, 
																			, 
																			Истина, 
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
КонецПроцедуры

&НаСервере
Функция ПолучитьПоследнийПериодЗаписей()
	
	ПоследнийПериод = Макс(Дата(2005, 01, 01), НачалоГода(ОбщегоНазначения.ТекущаяДатаПользователя()));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ПоследнийПериод);
	Запрос.УстановитьПараметр("ВидСтавокИПНиСН",  ПредопределенноеЗначение("Перечисление.ВидыСтавокИПНиСН.ПоИсчислениюИПН"));
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияОСтавках.Период
	|ИЗ
	|	РегистрСведений.СведенияОСтавкахИПНиСН.СрезПоследних(&ДатаАктуальности, ВидСтавокИПНиСН = &ВидСтавокИПНиСН) КАК СведенияОСтавках
	|УПОРЯДОЧИТЬ ПО
	|	СведенияОСтавках.НомерСтрокиСтавок
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоследнийПериод = Выборка.Период;
	КонецЕсли;
		
	Возврат ПоследнийПериод;
	
КонецФункции
